In [9]:
import pandas as pd

In [13]:
train_df = pd.read_csv(r'C:\Users\ka422490\Downloads\Spring 20\CAP-5610-Machine Learning\Assignments\H,W 1\titanic\train.csv')

In [12]:
test_df = pd.read_csv(r'C:\Users\ka422490\Downloads\Spring 20\CAP-5610-Machine Learning\Assignments\H,W 1\titanic\test.csv')

In [14]:
combine = [train_df, test_df]

In [15]:
result = pd.concat(combine)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [16]:
result.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450

In [17]:
type(result)

pandas.core.frame.DataFrame

In [18]:
result.dtypes

Age            float64
Cabin           object
Embarked        object
Fare           float64
Name            object
Parch            int64
PassengerId      int64
Pclass           int64
Sex             object
SibSp            int64
Survived       float64
Ticket          object
dtype: object

In [19]:
cols = result.columns

In [20]:
num_cols = result._get_numeric_data().columns

In [21]:
num_cols

Index(['Age', 'Fare', 'Parch', 'PassengerId', 'Pclass', 'SibSp', 'Survived'], dtype='object')

In [22]:
list(set(cols) - set(num_cols))

['Name', 'Ticket', 'Embarked', 'Sex', 'Cabin']

In [23]:
result.isnull().sum()

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64

In [24]:
result.describe()

,Age,Fare,Parch,PassengerId,Pclass,SibSp,Survived
count,1046.000000,1308.000000,1309.000000,1309.000000,1309.000000,1309.000000,891.000000
mean,29.881138,33.295479,0.385027,655.000000,2.294882,0.498854,0.383838
std,14.413493,51.758668,0.865560,378.020061,0.837836,1.041658,0.486592
min,0.170000,0.000000,0.000000,1.000000,1.000000,0.000000,0.000000
25%,21.000000,7.895800,0.000000,328.000000,2.000000,0.000000,0.000000
50%,28.000000,14.454200,0.000000,655.000000,3.000000,0.000000,0.000000
75%,39.000000,31.275000,0.000000,982.000000,3.000000,1.000000,1.000000
max,80.000000,512.329200,9.000000,1309.000000,3.000000,8.000000,1.000000

In [25]:
result.Sex.value_counts()

male      843
female    466
Name: Sex, dtype: int64

In [26]:
result.Name.value_counts()

Kelly, Mr. James                                    2
Connolly, Miss. Kate                                2
Fortune, Mr. Charles Alexander                      1
Kimball, Mrs. Edwin Nelson Jr (Gertrude Parsons)    1
Baclini, Miss. Marie Catherine                      1
                                                   ..
Mangan, Miss. Mary                                  1
Delalic, Mr. Redjo                                  1
Nysten, Miss. Anna Sofia                            1
Futrelle, Mr. Jacques Heath                         1
Foreman, Mr. Benjamin Laventall                     1
Name: Name, Length: 1307, dtype: int64

In [27]:
result.Cabin.value_counts()

C23 C25 C27        6
B57 B59 B63 B66    5
G6                 5
B96 B98            4
F4                 4
                  ..
A16                1
D56                1
C51                1
E68                1
C45                1
Name: Cabin, Length: 186, dtype: int64

In [28]:
result.Cabin.count()

295

In [29]:
result.Ticket.value_counts()

CA. 2343    11
CA 2144      8
1601         8
347082       7
347077       7
            ..
29751        1
250653       1
347060       1
237442       1
19924        1
Name: Ticket, Length: 929, dtype: int64

In [30]:
result.Ticket.count()

1309

In [31]:
result.Embarked.count()

1307

In [32]:
result.Embarked.value_counts()

S    914
C    270
Q    123
Name: Embarked, dtype: int64

In [33]:
result.Fare.value_counts()

8.0500     60
13.0000    59
7.7500     55
26.0000    50
7.8958     49
           ..
33.5000     1
7.8000      1
26.3875     1
15.5792     1
7.1417      1
Name: Fare, Length: 281, dtype: int64